#include <iostream>

/*
雇佣问题
    假如你要雇用一名新的办公助理。你先前的雇用尝试都失败了，于是你决定找一个雇用代理。
    雇用代理每天给你推荐一个应聘者。你面试这个人，然后决定是否雇用他。
    你必须付给雇用代理一小笔费用，以便面试应聘者。
    然而要真的雇用一个应聘者需要花更多的钱，因为你必须辞掉目前的办公助理，还要付一大笔中介费给雇用代理。
    你承诺在任何时候，都要找最适合的人来担任这项职务。
    因此，你决定在面试完每个应聘者后，如果该应聘者比目前的办公助理更合适，就会辞掉当前的办公助理，然后聘用新的。
    你愿意为该策略付费，但希望能够估算该费用会是多少。
*/
void hireAssistant(int n) {
    int best = 0;
    for (int i = 0; i < n; i++) {
        //面试候选人 i
        //if(候选人i比候选人best更好){
            //best = i;
            //雇佣候选人 i
        //}
    }
}



int main()
{
    std::cout << "Hello World!\n";
}
